---
kind: other
id: Methods.T:Autodesk.Revit.DB.NumberingSchemaType
source: html/60bfb875-4333-9920-db13-bc40937ed6b2.htm
---
# NumberingSchemaType Methods

Compares two Guid-based enum object based on their concrete class and GUID value.